trade_exp/src/Documents/ОрдерНаОтражениеПорчиТоваров/ОрдерНаОтражениеПорчиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c23a5480-4ef3-461a-a350-1c98133bdb26">
  <name>ОрдерНаОтражениеПорчиТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="55b567bd-5626-45ad-b372-21173d33e1c2">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b381face-f263-4829-b39c-41a34a656f44">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="707ee6b2-0e72-4780-828c-8ee015b98c11">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c77c1073-7ed9-4b56-89a8-b071d365b6a3">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c4c31aee-8206-4a0d-9361-d2a471fceb69">
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a8ad138c-3104-4741-aeeb-fb57ebb79758">
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8c1167c7-85a5-4ca3-8802-e3dee77a76d1">
    <name>ПодтвержденСкладом</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="052e0cb0-0000-4ddd-8a93-e840f2dbe73b">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="770b1e51-71e9-4a36-9488-e7a2697bccb6">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8f81acb2-ffed-47ef-a72f-2f85ae37c160">
      <name>Ячейка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="22f7ffae-bef9-468e-ab74-a9f28d48668b">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7ff7a9e2-271e-4868-822f-ad043715c2c2">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ecb09229-295f-4a5f-b39a-dc6800d37d19">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c20314ed-03be-42fe-b8b3-5d5a6ae459ac">
      <name>НоменклатураОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="383f0574-0e1d-4f71-9b06-219cf8db727e">
      <name>ХарактеристикаОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4a936e6c-a248-4d8c-8f93-03f293a6e34e">
      <name>ПодНазначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="08aad01b-cdf3-41d8-b90c-ab15f6da0b72">
      <name>УпаковкаОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fbc30293-7d8b-4eb8-b447-b082ecb78504">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6c05ea0d-3aba-45ee-b588-7e1c0b5aba33">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/РазмещениеНоменклатурыПоСкладскимЯчейкам/РазмещениеНоменклатурыПоСкладскимЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РазмещениеНоменклатурыПоСкладскимЯчейкам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ОсновнаяЯчейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7150e659-c510-45e5-9deb-fddf7441e996">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/ОрдерНаОтражениеПорчиТоваров/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&После("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПорчаТоваров") Тогда
		
		Склад = ДанныеЗаполнения.Склад;
		
		Для каждого Строка из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
			НоваяСтрока.КоличествоУпаковок = Строка.Количество;
		КонецЦикла;

	КонецЕсли;
КонецПроцедуры


&После("ОбработкаПроведения")
Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Альтерра
	ДопМодуль.КонтрольОстатков(ЭтотОбъект,Отказ);
    //-Альтерра        
	
	//Альтерра
	Если Ссылка.ПодтвержденСкладом Тогда
		РегистрыСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.СоздатьЯчейки(Отказ, Товары.ВыгрузитьКолонку("Номенклатура"), Склад, РабочийУчасток);
		РегистрыСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.СоздатьЯчейки(Отказ, Товары.ВыгрузитьКолонку("НоменклатураОприходование"), Склад, РабочийУчасток);
    КонецЕсли;
    //-Альтерра 
КонецПроцедуры

#КонецЕсли
